lib/services/scraper/video/tv/xmltv/data/downloadRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:download xmlns:m="urn:TMSWebServices" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<startTime xsi:type="xsd:dateTime">2011-11-11T08:00:00Z</startTime>
			<endTime xsi:type="xsd:dateTime">2011-11-12T08:00:00Z</endTime>
		</m:download>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>